class Args:
    def __init__(self):
    
        self.depth = 40
        #kgea = False
        self.constraint = False
        
        #此rand是指对两种不对全连接层剪枝的算法随机产生剪枝下标
        self.rand = False
        self.dataset = 'cifar100'
        self.arch = 'densenet'
        #指重新训练
        self.retrain = False
        self.cpu = True
        self.half = False
        self.print_freq = 20
        self.lr = 0.1
        self.ft_lr = 0.0001
        self.retrain_lr = 0.1
        self.epochs = 160
        self.batch_size = 256
        self.test_batch_size = 500
        self.val_batch_size = 500
        self.momentum = 0.9
        self.no_cuda = False
        self.seed = 1
        self.log_interval = 10
        self.weight_decay = 1e-4
        #最后三层是全连接层
        if self.depth == 40:
        
            self.ft_epochs = 160
            self.re_epochs = 160
            self.temp_epoch = 60
            self.filter_nums = [24, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 168, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 312, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 100]
            self.fc_nums = 100
            self.bn_nums = [24, 36, 48, 60, 72, 84, 96, 108, 120, 132, 144, 156, 168, 168, 180, 192, 204, 216, 228, 240, 252, 264, 276, 288, 300, 312, 312, 324, 336, 348, 360, 372, 384, 396, 408, 420, 432, 444, 456, 100]
            self.conv_layer = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39]
            self.fc_layer = [39]
            self.conv_name = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38']
            self.name = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38']
            self.fc_name = ['39']
            self.conv_name_dict = {'0': [], '1': [], '2': [], '3': [], '4': [], '5': [], '6': [], '7': [], '8': [], '9': [], '10': [], '11': [], '12': [], '13': [], '14': [], '15': [], '16': [], '17': [], '18': [], '19': [], '20': [], '21': [], '22': [], '23': [], '24': [], '25': [], '26': [], '27': [], '28': [], '29': [], '30': [], '31': [], '32': [], '33': [], '34': [], '35': [], '36': [], '37': [], '38': []}
            self.fc_name_dict = { '39': []}
            self.gene_length = 50
            self.filter_length = sum(self.filter_nums)
            self.accuracy = 74.610
        
        